# Titanic project ( Numpy & Pandas)

In [1]:
# Import libariries for exploring data.
# Numpy for linear algebra & Panadas for statistics.

import numpy as np 
import pandas as pd

In [2]:
# Import csv file of Data and read it.
# Assign Titanic_Data as Data Frame.

Titanic_Data = pd.read_csv('titanic dataset.csv')

In [3]:
# Getting the number of rows and columns in the dataset

Titanic_Data.shape

(891, 12)

### Description of Data Shape & Variablies:

Data is 891 observations of 12 variables. Description of these variables as follows:

PassengerId: unique id number to each passenger.
Survived: passenger Survived (1) or died (0).
Pclass: Passenger's class.
Name: Passenger's name.
Sex: Passenger's sex.
Age: Passenger's age.
SibSp: Number of siblings/spouses aboard.
Parch: Number of parents/children aboard.
Ticket: Ticket number.
Fare: Amount of money spent on ticket.
Cabin: Cabin Category.
Embarked: Port of passenger embarkation(C = Cherbourg, Q = Queenstown, S = Southampton).

In [4]:
# Assign .info() for knowing more information about Data.

Titanic_Data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [5]:
# Showing first 5 indexes of Data.

Titanic_Data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [6]:
# Showing last 5 indexes of Data.

Titanic_Data.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

previously cell obvious some essential information about the variables.

An numeric variable is one with values of integers or real numbers while a categorical variable is a variable that can take on one of a limited, and usually fixed, number of possible values.

### Sex 
 from this colume will explore and calculate percentage of Female(women) and Male(men) who survived.

In [7]:
# Number of people of each gender. 

Titanic_Data['Sex'].value_counts()

male      577
female    314
Name: Sex, dtype: int64

In [8]:
# Number of people survived.

Titanic_Data['Survived'].value_counts()

0    549
1    342
Name: Survived, dtype: int64

In [9]:
#percentage of women who survived by ratio_women equation.

women = Titanic_Data.loc[Titanic_Data.Sex == 'female']["Survived"]
ratio_women = sum(women)/len(women)

print("percentage of women who survived:", ratio_women)

percentage of women who survived: 0.7420382165605095

In [10]:
#percentage of men who survived by ratio_men equation.

men = Titanic_Data.loc[Titanic_Data.Sex == 'male']["Survived"]
ratio_men = sum(men)/len(men)

print("percentage of men who survived:", ratio_men)

percentage of men who survived: 0.18890814558058924

### More Explore for  Whole Data

In [11]:
#Assign .describe() for Essential statistical Data. 

Titanic_Data.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

Notice especially what type of variable each is, how many observations there are and some of the variable values.

An interesting observation could for example be the minimum age 0.42, do you know why this is?

### Dealing & Handling Missing Data

In [12]:
# Calculating Missing value of whole Data.
Titanic_Data.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

There are missing values for Age, Cabin and Embarked features. Deeply, there are many missing values for Age and Cabin features.

Firstly dealing with Cabin snice there is relationship between cabin and survival ratio.

In [13]:
Titanic_Data['Cabin'].isnull().sum()

687

In [14]:
Titanic_Data['Cabin'].unique()

array([nan, 'C85', 'C123', 'E46', 'G6', 'C103', 'D56', 'A6',
       'C23 C25 C27', 'B78', 'D33', 'B30', 'C52', 'B28', 'C83', 'F33',
       'F G73', 'E31', 'A5', 'D10 D12', 'D26', 'C110', 'B58 B60', 'E101',
       'F E69', 'D47', 'B86', 'F2', 'C2', 'E33', 'B19', 'A7', 'C49', 'F4',
       'A32', 'B4', 'B80', 'A31', 'D36', 'D15', 'C93', 'C78', 'D35',
       'C87', 'B77', 'E67', 'B94', 'C125', 'C99', 'C118', 'D7', 'A19',
       'B49', 'D', 'C22 C26', 'C106', 'C65', 'E36', 'C54',
       'B57 B59 B63 B66', 'C7', 'E34', 'C32', 'B18', 'C124', 'C91', 'E40',
       'T', 'C128', 'D37', 'B35', 'E50', 'C82', 'B96 B98', 'E10', 'E44',
       'A34', 'C104', 'C111', 'C92', 'E38', 'D21', 'E12', 'E63', 'A14',
       'B37', 'C30', 'D20', 'B79', 'E25', 'D46', 'B73', 'C95', 'B38',
       'B39', 'B22', 'C86', 'C70', 'A16', 'C101', 'C68', 'A10', 'E68',
       'B41', 'A20', 'D19', 'D50', 'D9', 'A23', 'B50', 'A26', 'D48',
       'E58', 'C126', 'B71', 'B51 B53 B55', 'D49', 'B5', 'B20', 'F G63',
       'C62 C64', 'E24', 'C90', 'C45', 'E8', 'B101', 'D45', 'C46', 'D30',
       'E121', 'D11', 'E77', 'F38', 'B3', 'D6', 'B82 B84', 'D17', 'A36',
       'B102', 'B69', 'E49', 'C47', 'D28', 'E17', 'A24', 'C50', 'B42',
       'C148'], dtype=object)

All Missing values are 866. Deeply, This is used to determine whether the cabin is owned or not calculate percentage of it.

In [15]:
# The percentage of missing values cabin column. 
percent=(687/891)*100
print("The percentage of missing values in 'Cabin' column is", round(percent, 2), '%')

The percentage of missing values in 'Cabin' column is 77.1 %

Not just dropping the column because a column with many missing values does not mean that it can't provide the model with very useful information.

Firstly glance the most significant columns are Pclass, Sex, Age, SibSp, Parch, Fare and maybe Embarked. PassengerId is irrelevant and the column Ticket doesn't seem to play a significant role because 5-7 digits numbers on tickets and letters seem to be random and not relevant to a specific class or some other column.

Another thought is that moral code dictates that the physically weaker passengers should have been protected by the young male adults so we expect to see a higher survival rate to women, children and older people and a lower survival rate to young male adults.

Cabin has missing value but it because many people would be sharing the dorm area of the ship. We can mark such data with our represention of dorm. lets marks it with Z0,
Z -> room, 0 -> No Room.

In [16]:

Adjust_Cabin=Titanic_Data.Cabin.isna()
Titanic_Data.loc[Titanic_Data[Adjust_Cabin].index, ['Cabin']] = 'Z0'
Titanic_Data.Cabin.isna().sum()

0

In [17]:
Adjust_Cabin= Titanic_Data.Age.isna()
Titanic_Data[Adjust_Cabin]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,Z0,Q
17,18,1,2,"Williams, Mr. Charles Eugene",male,NaN,0,0,244373,13.0000,Z0,S
19,20,1,3,"Masselmani, Mrs. Fatima",female,NaN,0,0,2649,7.2250,Z0,C
26,27,0,3,"Emir, Mr. Farred Chehab",male,NaN,0,0,2631,7.2250,Z0,C
28,29,1,3,"O'Dwyer, Miss. Ellen ""Nellie""",female,NaN,0,0,330959,7.8792,Z0,Q
...,...,...,...,...,...,...,...,...,...,...,...,...
859,860,0,3,"Razi, Mr. Raihed",male,NaN,0,0,2629,7.2292,Z0,C
863,864,0,3,"Sage, Miss. Dorothy Edith ""Dolly""",female,NaN,8,2,CA. 2343,69.5500,Z0,S
868,869,0,3,"van Melkebeke, Mr. Philemon",male,NaN,0,0,345777,9.5000,Z0,S
878,879,0,3,"Laleff, Mr. Kristo",male,NaN,0,0,349217,7.8958,Z0,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,Z0,S

In [18]:
# Conclusion - Missing age data has children(Master), younger Female(Miss), Female(Mrs), Male(Mr,Dr) 

Titanic_Data[Adjust_Cabin]['Name'].apply(lambda x : x.split(',')[1].split('.')[0].strip()).value_counts()

Mr        119
Miss       36
Mrs        17
Master      4
Dr          1
Name: Name, dtype: int64

In [19]:
# Conclusion- these are passanger count as per title. I will use this for age imputation.

Titanic_Data['NameTitle'] = Titanic_Data.Name.apply(lambda x : x.split(',')[1].split('.')[0].strip())
Titanic_Data.NameTitle.value_counts()

Mr              517
Miss            182
Mrs             125
Master           40
Dr                7
Rev               6
Mlle              2
Major             2
Col               2
the Countess      1
Capt              1
Ms                1
Sir               1
Lady              1
Mme               1
Don               1
Jonkheer          1
Name: NameTitle, dtype: int64

Handling this missing after filtering separately it with median which is more accurate than mean since it littel sensitive with outliers.

In [20]:
# Age up to master

filter_master = (Titanic_Data.NameTitle == 'Master')
master_age= Titanic_Data[filter_master].Age.median()
master_age

3.5

In [21]:
# Age up to Mr

filter_mr = (Titanic_Data.NameTitle == 'Mr')
mr_age = Titanic_Data[filter_mr].Age.median()
mr_age

30.0

In [22]:
# Age up to Mrs

filter_mrs = (Titanic_Data.NameTitle == 'Mrs')
mrs_age = Titanic_Data[filter_mrs].Age.median()
mrs_age

35.0

In [23]:
# Age up to Miss

filter_miss = (Titanic_Data.NameTitle == 'Miss')
miss_age = Titanic_Data[filter_miss].Age.median()
miss_age

21.0

In [24]:
# Age up to dr

filter_dr = (Titanic_Data.NameTitle == 'dr')
dr_age = Titanic_Data[filter_dr].Age.median()
dr_age

nan

In [25]:
Titanic_Data.loc[Titanic_Data[(Titanic_Data.Age.isna() ) & (filter_master) ].index, 'Age' ] = master_age
Titanic_Data.loc[Titanic_Data[(Titanic_Data.Age.isna() ) & (filter_mr) ].index, 'Age' ] = mr_age
Titanic_Data.loc[Titanic_Data[(Titanic_Data.Age.isna() ) & (filter_mrs) ].index, 'Age' ] = mrs_age
Titanic_Data.loc[Titanic_Data[(Titanic_Data.Age.isna() ) & (filter_miss) ].index, 'Age' ] = miss_age
Titanic_Data.loc[Titanic_Data[(Titanic_Data.Age.isna() ) & (filter_dr) ].index, 'Age' ] = dr_age

Finally as much as possible Core missing values of Cabin and Age handeled.